{"class_name": "Tokenizer", "config": {"num_words": 10000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 2500, "word_counts": "{\"sharply\": 360, \"investors\": 119, \"worried\": 28, \"about\": 325, \"apple\": 1283, \"outlook\": 140, \"new\": 300, \"data\": 374, \"suggests\": 270, \"market\": 1090, \"participants\": 162, \"concerned\": 35, \"inc\": 489, \"reveals\": 104, \"uncertain\": 47, \"aapl\": 770, \"shareholders\": 157, \"the\": 504, \"tech\": 867, \"giant\": 504, \"which\": 90, \"analysts\": 851, \"are\": 90, \"monitoring\": 90, \"closely\": 90, \"traders\": 157, \"steadily\": 320, \"hits\": 30, \"all\": 72, \"time\": 72, \"high\": 111, \"respond\": 270, \"climbs\": 41, \"to\": 902, \"historic\": 39, \"peak\": 39, \"surprisingly\": 106, \"reaches\": 48, \"record\": 39, \"breaking\": 39, \"based\": 104, \"on\": 104, \"current\": 104, \"trends\": 329, \"touches\": 31, \"in\": 230, \"today's\": 230, \"session\": 230, \"uneasy\": 30, \"according\": 481, \"unexpectedly\": 393, \"supply\": 77, \"chain\": 35, \"issues\": 35, \"hurt\": 175, \"production\": 340, \"distribution\": 52, \"setbacks\": 52, \"recent\": 86, \"reports\": 311, \"indicate\": 86, \"that\": 86, \"disruptions\": 42, \"as\": 373, \"industry\": 98, \"observers\": 98, \"note\": 98, \"stocks\": 73, \"rebound\": 170, \"with\": 170, \"leading\": 170, \"sources\": 280, \"confirm\": 280, \"sector\": 184, \"shares\": 54, \"technology\": 82, \"equities\": 43, \"notably\": 295, \"show\": 225, \"logistical\": 46, \"challenges\": 46, \"announces\": 145, \"breakthrough\": 145, \"innovation\": 145, \"affecting\": 108, \"overall\": 108, \"investor\": 108, \"sentiment\": 108, \"during\": 240, \"early\": 240, \"trading\": 240, \"rapidly\": 350, \"downgrade\": 205, \"sell\": 205, \"marginally\": 305, \"rallies\": 145, \"leads\": 145, \"faces\": 165, \"delays\": 165, \"significantly\": 275, \"reacts\": 260, \"strongly\": 260, \"financial\": 100, \"experts\": 335, \"strong\": 135, \"iphone\": 135, \"sales\": 135, \"boost\": 135, \"stock\": 550, \"amid\": 375, \"global\": 225, \"weak\": 185, \"demand\": 185, \"concerns\": 185, \"hit\": 185, \"optimistic\": 185, \"apple's\": 88, \"growth\": 185, \"aapl's\": 49, \"'s\": 48, \"slightly\": 290, \"dips\": 150, \"uncertainty\": 150, \"struggles\": 130, \"falls\": 130, \"say\": 235, \"crash\": 165, \"fear\": 165, \"rising\": 165, \"surges\": 80, \"after\": 80, \"earnings\": 80, \"fresh\": 42, \"upgrade\": 175, \"buy\": 175}", "word_docs": "{\"sharply\": 360, \"outlook\": 140, \"worried\": 28, \"investors\": 111, \"new\": 296, \"suggests\": 270, \"apple\": 1283, \"data\": 363, \"about\": 325, \"concerned\": 35, \"participants\": 152, \"market\": 925, \"inc\": 489, \"reveals\": 104, \"aapl\": 770, \"uncertain\": 47, \"are\": 90, \"giant\": 504, \"monitoring\": 90, \"tech\": 799, \"which\": 90, \"closely\": 90, \"shareholders\": 146, \"the\": 504, \"analysts\": 759, \"traders\": 146, \"steadily\": 320, \"time\": 72, \"hits\": 30, \"respond\": 270, \"high\": 111, \"all\": 72, \"to\": 796, \"climbs\": 41, \"historic\": 39, \"peak\": 39, \"record\": 39, \"reaches\": 48, \"breaking\": 39, \"surprisingly\": 106, \"on\": 104, \"based\": 104, \"current\": 104, \"trends\": 324, \"touches\": 31, \"in\": 230, \"today's\": 230, \"session\": 230, \"uneasy\": 30, \"according\": 453, \"supply\": 77, \"unexpectedly\": 386, \"production\": 340, \"hurt\": 175, \"issues\": 35, \"chain\": 35, \"setbacks\": 52, \"distribution\": 52, \"disruptions\": 42, \"that\": 86, \"indicate\": 86, \"recent\": 86, \"reports\": 307, \"industry\": 98, \"observers\": 98, \"note\": 98, \"as\": 359, \"sources\": 280, \"stocks\": 73, \"rebound\": 170, \"with\": 170, \"confirm\": 280, \"leading\": 170, \"sector\": 184, \"shares\": 54, \"equities\": 43, \"technology\": 82, \"notably\": 295, \"show\": 225, \"challenges\": 46, \"logistical\": 46, \"announces\": 145, \"innovation\": 145, \"breakthrough\": 145, \"investor\": 108, \"overall\": 108, \"sentiment\": 108, \"affecting\": 108, \"trading\": 240, \"during\": 240, \"early\": 240, \"rapidly\": 350, \"downgrade\": 205, \"sell\": 205, \"marginally\": 305, \"rallies\": 145, \"leads\": 145, \"delays\": 165, \"faces\": 165, \"significantly\": 275, \"reacts\": 260, \"strongly\": 260, \"experts\": 327, \"financial\": 100, \"boost\": 135, \"stock\": 550, \"iphone\": 135, \"sales\": 135, \"strong\": 135, \"amid\": 370, \"global\": 225, \"weak\": 185, \"demand\": 185, \"hit\": 185, \"concerns\": 185, \"optimistic\": 185, \"growth\": 185, \"apple's\": 88, \"aapl's\": 49, \"'s\": 48, \"slightly\": 290, \"uncertainty\": 150, \"dips\": 150, \"falls\": 130, \"say\": 235, \"struggles\": 130, \"fear\": 165, \"crash\": 165, \"rising\": 165, \"surges\": 80, \"earnings\": 80, \"after\": 80, \"fresh\": 42, \"buy\": 175, \"upgrade\": 175}", "index_docs": "{\"17\": 360, \"75\": 140, \"136\": 28, \"82\": 111, \"26\": 296, \"32\": 270, \"2\": 1283, \"15\": 363, \"22\": 325, \"130\": 35, \"65\": 152, \"3\": 925, \"11\": 489, \"89\": 104, \"7\": 770, \"119\": 47, \"98\": 90, \"10\": 504, \"99\": 90, \"5\": 799, \"97\": 90, \"100\": 90, \"66\": 146, \"9\": 504, \"6\": 759, \"67\": 146, \"23\": 320, \"112\": 72, \"134\": 30, \"33\": 270, \"83\": 111, \"111\": 72, \"4\": 796, \"125\": 41, \"126\": 39, \"127\": 39, \"128\": 39, \"117\": 48, \"129\": 39, \"88\": 106, \"91\": 104, \"90\": 104, \"92\": 104, \"21\": 324, \"133\": 31, \"40\": 230, \"41\": 230, \"42\": 230, \"135\": 30, \"12\": 453, \"109\": 77, \"13\": 386, \"19\": 340, \"54\": 175, \"132\": 35, \"131\": 35, \"115\": 52, \"114\": 52, \"123\": 42, \"104\": 86, \"103\": 86, \"102\": 86, \"24\": 307, \"94\": 98, \"95\": 98, \"96\": 98, \"16\": 359, \"29\": 280, \"110\": 73, \"57\": 170, \"58\": 170, \"30\": 280, \"59\": 170, \"53\": 184, \"113\": 54, \"122\": 43, \"105\": 82, \"27\": 295, \"43\": 225, \"121\": 46, \"120\": 46, \"70\": 145, \"72\": 145, \"71\": 145, \"86\": 108, \"85\": 108, \"87\": 108, \"84\": 108, \"38\": 240, \"36\": 240, \"37\": 240, \"18\": 350, \"45\": 205, \"46\": 205, \"25\": 305, \"73\": 145, \"74\": 145, \"61\": 165, \"60\": 165, \"31\": 275, \"34\": 260, \"35\": 260, \"20\": 327, \"93\": 100, \"79\": 135, \"8\": 550, \"77\": 135, \"78\": 135, \"76\": 135, \"14\": 370, \"44\": 225, \"47\": 185, \"48\": 185, \"50\": 185, \"49\": 185, \"51\": 185, \"52\": 185, \"101\": 88, \"116\": 49, \"118\": 48, \"28\": 290, \"69\": 150, \"68\": 150, \"81\": 130, \"39\": 235, \"80\": 130, \"63\": 165, \"62\": 165, \"64\": 165, \"106\": 80, \"108\": 80, \"107\": 80, \"124\": 42, \"56\": 175, \"55\": 175}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"apple\", \"3\": \"market\", \"4\": \"to\", \"5\": \"tech\", \"6\": \"analysts\", \"7\": \"aapl\", \"8\": \"stock\", \"9\": \"the\", \"10\": \"giant\", \"11\": \"inc\", \"12\": \"according\", \"13\": \"unexpectedly\", \"14\": \"amid\", \"15\": \"data\", \"16\": \"as\", \"17\": \"sharply\", \"18\": \"rapidly\", \"19\": \"production\", \"20\": \"experts\", \"21\": \"trends\", \"22\": \"about\", \"23\": \"steadily\", \"24\": \"reports\", \"25\": \"marginally\", \"26\": \"new\", \"27\": \"notably\", \"28\": \"slightly\", \"29\": \"sources\", \"30\": \"confirm\", \"31\": \"significantly\", \"32\": \"suggests\", \"33\": \"respond\", \"34\": \"reacts\", \"35\": \"strongly\", \"36\": \"during\", \"37\": \"early\", \"38\": \"trading\", \"39\": \"say\", \"40\": \"in\", \"41\": \"today's\", \"42\": \"session\", \"43\": \"show\", \"44\": \"global\", \"45\": \"downgrade\", \"46\": \"sell\", \"47\": \"weak\", \"48\": \"demand\", \"49\": \"concerns\", \"50\": \"hit\", \"51\": \"optimistic\", \"52\": \"growth\", \"53\": \"sector\", \"54\": \"hurt\", \"55\": \"upgrade\", \"56\": \"buy\", \"57\": \"rebound\", \"58\": \"with\", \"59\": \"leading\", \"60\": \"faces\", \"61\": \"delays\", \"62\": \"crash\", \"63\": \"fear\", \"64\": \"rising\", \"65\": \"participants\", \"66\": \"shareholders\", \"67\": \"traders\", \"68\": \"dips\", \"69\": \"uncertainty\", \"70\": \"announces\", \"71\": \"breakthrough\", \"72\": \"innovation\", \"73\": \"rallies\", \"74\": \"leads\", \"75\": \"outlook\", \"76\": \"strong\", \"77\": \"iphone\", \"78\": \"sales\", \"79\": \"boost\", \"80\": \"struggles\", \"81\": \"falls\", \"82\": \"investors\", \"83\": \"high\", \"84\": \"affecting\", \"85\": \"overall\", \"86\": \"investor\", \"87\": \"sentiment\", \"88\": \"surprisingly\", \"89\": \"reveals\", \"90\": \"based\", \"91\": \"on\", \"92\": \"current\", \"93\": \"financial\", \"94\": \"industry\", \"95\": \"observers\", \"96\": \"note\", \"97\": \"which\", \"98\": \"are\", \"99\": \"monitoring\", \"100\": \"closely\", \"101\": \"apple's\", \"102\": \"recent\", \"103\": \"indicate\", \"104\": \"that\", \"105\": \"technology\", \"106\": \"surges\", \"107\": \"after\", \"108\": \"earnings\", \"109\": \"supply\", \"110\": \"stocks\", \"111\": \"all\", \"112\": \"time\", \"113\": \"shares\", \"114\": \"distribution\", \"115\": \"setbacks\", \"116\": \"aapl's\", \"117\": \"reaches\", \"118\": \"'s\", \"119\": \"uncertain\", \"120\": \"logistical\", \"121\": \"challenges\", \"122\": \"equities\", \"123\": \"disruptions\", \"124\": \"fresh\", \"125\": \"climbs\", \"126\": \"historic\", \"127\": \"peak\", \"128\": \"record\", \"129\": \"breaking\", \"130\": \"concerned\", \"131\": \"chain\", \"132\": \"issues\", \"133\": \"touches\", \"134\": \"hits\", \"135\": \"uneasy\", \"136\": \"worried\"}", "word_index": "{\"<OOV>\": 1, \"apple\": 2, \"market\": 3, \"to\": 4, \"tech\": 5, \"analysts\": 6, \"aapl\": 7, \"stock\": 8, \"the\": 9, \"giant\": 10, \"inc\": 11, \"according\": 12, \"unexpectedly\": 13, \"amid\": 14, \"data\": 15, \"as\": 16, \"sharply\": 17, \"rapidly\": 18, \"production\": 19, \"experts\": 20, \"trends\": 21, \"about\": 22, \"steadily\": 23, \"reports\": 24, \"marginally\": 25, \"new\": 26, \"notably\": 27, \"slightly\": 28, \"sources\": 29, \"confirm\": 30, \"significantly\": 31, \"suggests\": 32, \"respond\": 33, \"reacts\": 34, \"strongly\": 35, \"during\": 36, \"early\": 37, \"trading\": 38, \"say\": 39, \"in\": 40, \"today's\": 41, \"session\": 42, \"show\": 43, \"global\": 44, \"downgrade\": 45, \"sell\": 46, \"weak\": 47, \"demand\": 48, \"concerns\": 49, \"hit\": 50, \"optimistic\": 51, \"growth\": 52, \"sector\": 53, \"hurt\": 54, \"upgrade\": 55, \"buy\": 56, \"rebound\": 57, \"with\": 58, \"leading\": 59, \"faces\": 60, \"delays\": 61, \"crash\": 62, \"fear\": 63, \"rising\": 64, \"participants\": 65, \"shareholders\": 66, \"traders\": 67, \"dips\": 68, \"uncertainty\": 69, \"announces\": 70, \"breakthrough\": 71, \"innovation\": 72, \"rallies\": 73, \"leads\": 74, \"outlook\": 75, \"strong\": 76, \"iphone\": 77, \"sales\": 78, \"boost\": 79, \"struggles\": 80, \"falls\": 81, \"investors\": 82, \"high\": 83, \"affecting\": 84, \"overall\": 85, \"investor\": 86, \"sentiment\": 87, \"surprisingly\": 88, \"reveals\": 89, \"based\": 90, \"on\": 91, \"current\": 92, \"financial\": 93, \"industry\": 94, \"observers\": 95, \"note\": 96, \"which\": 97, \"are\": 98, \"monitoring\": 99, \"closely\": 100, \"apple's\": 101, \"recent\": 102, \"indicate\": 103, \"that\": 104, \"technology\": 105, \"surges\": 106, \"after\": 107, \"earnings\": 108, \"supply\": 109, \"stocks\": 110, \"all\": 111, \"time\": 112, \"shares\": 113, \"distribution\": 114, \"setbacks\": 115, \"aapl's\": 116, \"reaches\": 117, \"'s\": 118, \"uncertain\": 119, \"logistical\": 120, \"challenges\": 121, \"equities\": 122, \"disruptions\": 123, \"fresh\": 124, \"climbs\": 125, \"historic\": 126, \"peak\": 127, \"record\": 128, \"breaking\": 129, \"concerned\": 130, \"chain\": 131, \"issues\": 132, \"touches\": 133, \"hits\": 134, \"uneasy\": 135, \"worried\": 136}"}}